HELP_DIALOGS = {
    "movable_entity": {
        "title": "엔티티 사용법",
        "talks": [
            "이 엔티티는 이동할 수 있습니다.",
            "선택 후, 이동 가능한 타일을 확인하세요.",
            "공격 가능한 위치는 빨간색으로 표시됩니다."
        ],
    },
    "non_movable_entity": {
        "title": "건물 사용법",
        "talks": [
            "이 건물은 이동할 수 없습니다.",
            "특정 조건에서 상호작용할 수 있습니다."
        ],
    },
    "first_help": {
        "title": "기본적인 조작법 안내",
        "talks": [
            "기본적인 조작은 다음과 같습니다.",
            "아군 캐릭터를 좌클릭하면 해당 아군 캐릭터가 선택되고, 이동 가능한 타일이 파란색으로 표시됩니다.",
            "이때 파란색 타일을 좌클릭하여 캐릭터를 이동시키거나, 이동하지 않은 채 아군 캐릭터를 다시 좌클릭하면 공격 등의 행동을 선택할 수 있습니다.",
            "적 캐릭터를 좌클릭하면 해당 적 캐릭터의 정보가 표시됩니다.",
            "어떤 캐릭터든지 우클릭하면 해당 캐릭터의 공격 범위가 나타납니다",
        ],
    }
}