HELP_DIALOGS = {
    "ally": {
        "title": "아군 캐릭터",
        "talks": [
            "우클릭을 누르고 있으면 이동 범위가 나타납니다.",
            "이동 범위는 파란색, 공격 가능 위치는 빨간색으로 표시됩니다.",
            "이동 후 우클릭을 누를 시 이전 위치로 돌아갈 수 있습니다."
        ],
    },
    "non_movable_entity": {
        "title": "건물",
        "talks": [
            "상호작용할 수 있는 건물입니다.",
        ],
    },
    "first_help": {
        "title": "기본적인 조작법 안내",
        "talks": [
            "기본적인 조작은 다음과 같습니다.",
            "아군 캐릭터를 좌클릭하면 해당 아군 캐릭터가 선택되고, 이동 가능한 타일이 파란색으로 표시됩니다.",
            "이때 파란색 타일을 좌클릭하여 캐릭터를 이동시키거나, 이동하지 않은 채 아군 캐릭터를 다시 좌클릭하면 공격 등의 행동을 선택할 수 있습니다.",
            "캐릭터를 이동시킨 후에 우클릭을 누를 시 이전 위치로 돌아갈 수 있습니다.",
            "적 캐릭터를 좌클릭하면 해당 적 캐릭터의 정보가 표시됩니다.",
            "어떤 캐릭터든지 우클릭하면 해당 캐릭터의 공격 범위가 나타나고, 첫 번째 우클릭 시 도움말이 다시 나타납니다.",
        ],
    },
    "foe": {
        "title": "적",
        "talks": [
            "적 캐릭터입니다.",
            "우클릭을 누르고 있으면 이동 범위가 나타납니다.",
            "이동 범위는 파란색, 공격 가능 위치는 빨간색으로 표시됩니다.",
            "공격 범위에 노출되지 않게 조심하세요!"
        ]
    }
}